buraky36/Barfas_Projects/myProjects/1_Access_Control_Terminal/Docs/ESP32_BLE_Wifi_V201/ESP32_BLE_Wifi_V201.ino
#include "esp_bt.h"
#include "esp_idf_version.h"
#include "mqtt_client.h"
#include "esp_crt_bundle.h"
#include <ArduinoJson.h>
#include <BLE2902.h>
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <HTTPClient.h>
#include <Preferences.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <mbedtls/md.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <sys/time.h>

// Sunucu Ayarları
#define CLAIM_URL "https://api.onloi.com/v1/devices/claim"

// BLE Servis ve Karakteristik UUID'leri (Nordic UART standardı)
#define SERVICE_UUID "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"
#define CHARACTERISTIC_UUID_RX "6E400002-B5A3-F393-E0A9-E50E24DCCA9E" // Mobil yazma yapar
#define CHARACTERISTIC_UUID_TX "6E400003-B5A3-F393-E0A9-E50E24DCCA9E" // ESP32 notify yapar

// Test Modu
#define ENABLE_SERIAL_TEST

#ifdef ENABLE_SERIAL_TEST
#define DEBUG_PRINT(...) Serial.print(__VA_ARGS__)
#define DEBUG_PRINTLN(...) Serial.println(__VA_ARGS__)
#define DEBUG_PRINTF(...) Serial.printf(__VA_ARGS__)
#else
#define DEBUG_PRINT(...)
#define DEBUG_PRINTLN(...)
#define DEBUG_PRINTF(...)
#endif

// Global Cihaz Bilgileri
String device_id = "Smart2026";
String device_code = "UNKNOWN";
String ble_name;

// Onloi Protokol Tanımları
#define SOF_BYTE 0x4F
#define VER_BYTE 0x02

// MSG_TYPE
#define MSG_TYPE_REQUEST 0x01
#define MSG_TYPE_RESPONSE 0x02
#define MSG_TYPE_EVENT 0x03
#define MSG_TYPE_COMMAND 0x04
#define MSG_TYPE_ACK 0x05

// CMD Kodları
#define CMD_HANDSHAKE 0x01
#define CMD_PROVISION 0x02
#define CMD_GET_SSIDS 0x03
#define CMD_CONNECT_WIFI 0x04
#define CMD_LOCK_OPENED 0x10
#define CMD_PIN_ENTERED 0x12
#define CMD_NFC_SCANNED 0x13
#define CMD_QR_SCANNED 0x14
#define CMD_FINGERPRINT_SCANNED 0x15
#define CMD_BUTTON_UNLOCK_REQ 0x16
#define CMD_SESSION_START 0x30
#define CMD_BATTERY_REPORT 0x32
#define CMD_TIME_SYNC 0x33
#define CMD_REGISTRATION 0x34
#define CMD_OFFLINE_LOG_BATCH 0x35
#define CMD_REMOTE_OPEN 0x40
#define CMD_FP_ENROLL_START 0x46
#define CMD_CARD_ENROLL_START 0x47
#define CMD_FP_ENROLLED 0x26
#define CMD_CARD_ENROLLED 0x27
#define CMD_FACTORY_RESET 0x50
#define CMD_ACK 0x05

// Legacy MCU Haberleşme (0x55AA)
#define Header 0x55AA
#define Version 0x00
#define Wifi_Status_Data_Len 1
#define Wifi_Reset1 0x03
#define Wifi_Reset2 0x04
#define Log_State 0x05
#define GMT_Time 0x10
#define Temporary_Pass 0xDD

// STM32 UART Protokolü (0xA5)
#define STM32_CMD_BATTERY_REPORT 0x04
#define STM32_CMD_EVENT_LOG 0x20
#define STM32_CMD_FACTORY_RESET 0xFF
#define STM32_CMD_WIFI_RESET 0x0F

#define STM32_CMD_SET_SOUND 0x05
#define STM32_CMD_SET_LANGUAGE 0x06
#define STM32_CMD_FIND_DEVICE 0x07
#define STM32_CMD_QUERY_SETTINGS 0x0A
#define STM32_CMD_QUERY_BATTERY 0x0B
#define STM32_CMD_QUERY_TIME 0x0D
#define STM32_CMD_RESPONSE 0x0E

#define STM32_RESP_OK 0x00
#define STM32_RESP_ERROR 0x01
#define STM32_RESP_SERVER_ERR 0x02
#define STM32_RESP_NO_WIFI 0x03
#define STM32_RESP_SERVER_REJ 0x04

// UART Pinleri
#define RX_PIN 16
#define TX_PIN 17
#define BAUD_RATE 115200
#define STREAM_SIZE 256

HardwareSerial SerialUART(1);

static uint8_t stream_buf[STREAM_SIZE];
static size_t stream_len = 0;

// Unified buffers for STM32 connection
static uint8_t stm32_buffer[128];
static size_t stm32_buffer_len = 0;

// BLE Durumları
BLECharacteristic *pCharacteristicTX;
Preferences preferences;
bool wifiConnected = false;
bool deviceConnected = false;
bool shouldStopBLE = false;
bool bleMode = false;

// BLE Alım Tamponu
static uint8_t ble_rx_buffer[512];
static size_t ble_rx_len = 0;

// MQTT Global Değişkenleri
esp_mqtt_client_handle_t mqtt_client = NULL;
bool mqtt_connected = false;
uint16_t mqtt_seq = 0;

// MCU Erişim Talebi Takip Değişkenleri
static uint8_t pending_mcu_cmd = 0;
static uint16_t pending_mcu_seq = 0;
static unsigned long pending_mcu_time = 0;

// MQTT Konuları (Topic'ler)
String topic_cmd;
String topic_reply;
String topic_config;
String topic_lifecycle;
String topic_telemetry;
String topic_event;
String topic_log;
String topic_ack;

// NVS Tercih Değişkenleri
String mqtt_host;
uint16_t mqtt_port = 8883;
String mqtt_client_id;
String mqtt_user;
String mqtt_pass;
String device_secret;
uint16_t session_epoch = 1;

// Zaman ve Durum Yönetimi
time_t serverEpoch = 0;
unsigned long long serverMillis = 0;
bool Remote_Open = false;
unsigned long remoteOpenTimestamp = 0;
const unsigned long REMOTE_OPEN_LOCK_MS = 15000;
uint32_t remote_open_request_id = 0;
uint32_t active_fp_enroll_request_id = 0;
uint32_t active_nfc_enroll_request_id = 0;
bool door_opened_confirmed = false;

WiFiClientSecure client;

// Legacy Frame Struct
typedef struct {
  uint16_t header;
  uint8_t version;
  uint8_t command;
  uint16_t length;
  uint8_t *data;
  uint8_t checksum;
} Frame;

// Prototipler
void resetWiFi();
bool connectToWiFi(const char *ssid, const char *password);
bool loadWiFiCredentials(String &ssid, String &pass);
void saveWiFiCredentials(const char *ssid, const char *pass);
void clearWiFiCredentials();
void factoryReset();
void startBLE();
bool parseNextFrame(Frame *out);
void processIncoming(const uint8_t *buf, size_t len);
void sendStatusUART(uint8_t status);
void sendNetworkStatus(uint8_t statusCode);
void handleSTM32Commands();
void sendSTM32Packet(uint8_t cmd, const uint8_t *payload, uint8_t payload_len);
void sendSTM32SoundSetting(uint8_t enable);
void sendSTM32LanguageSetting(uint8_t english);
void sendSTM32FindDevice();
void sendSTM32QuerySettings();
void sendSTM32QueryBattery();

// NVS Onloi Ayarları
bool loadOnloiConfig() {
  preferences.begin("onloi", true);
  bool claimed = preferences.getUChar("claimed", 0) == 1;
  if (claimed) {
    mqtt_host = preferences.getString("mqtt_host", "");
    mqtt_port = preferences.getUShort("mqtt_port", 8883);
    mqtt_client_id = preferences.getString("mqtt_client_id", "");
    mqtt_user = preferences.getString("mqtt_user", "");
    mqtt_pass = preferences.getString("mqtt_pass", "");
    device_secret = preferences.getString("device_secret", "");
    session_epoch = preferences.getUShort("session_epoch", 1);
  }
  preferences.end();
  return claimed;
}

void saveOnloiConfig(const String &host, uint16_t port, const String &clientId, const String &user, const String &pass, const String &secret, uint16_t epoch) {
  preferences.begin("onloi", false);
  preferences.putUChar("claimed", 1);
  preferences.putString("mqtt_host", host);
  preferences.putUShort("mqtt_port", port);
  preferences.putString("mqtt_client_id", clientId);
  preferences.putString("mqtt_user", user);
  preferences.putString("mqtt_pass", pass);
  preferences.putString("device_secret", secret);
  preferences.putUShort("session_epoch", epoch);
  preferences.end();
}

void saveProvisionToken(const String &token) {
  preferences.begin("onloi", false);
  preferences.putString("prov_token", token);
  preferences.end();
}

