buraky36/Barfas_Projects/myProjects/1_Access_Control_Terminal/Docs/ESP32_BLE_Wifi_V201/ESP32_BLE_Wifi_V201.ino
String loadProvisionToken() {
  preferences.begin("onloi", true);
  String token = preferences.getString("prov_token", "");
  preferences.end();
  return token;
}

void clearOnloiConfig() {
  preferences.begin("onloi", false);
  preferences.clear();
  preferences.end();
}

void queryDeviceModelFromMCU() {
  preferences.begin("onloi", false);
  String saved_model = preferences.getString("model", "");
  
  if (saved_model.length() > 0) {
    device_code = saved_model;
    ble_name = device_code;
    DEBUG_PRINTF("Kayitli cihaz modeli hafizadan yuklendi: %s\n", device_code.c_str());
    preferences.end();
    return;
  }
  
  DEBUG_PRINTLN("Cihaz modeli hafizada yok, MCU'dan talep ediliyor...");
  
  // A5 89 01 8A 5A
  uint8_t query_packet[] = {0xA5, 0x89, 0x01, 0x8A, 0x5A};
  
  for (int retry = 1; retry <= 10; retry++) {
    DEBUG_PRINTF("Model sorgusu gonderiliyor (Deneme %d/10)...\n", retry);
    
    // Clear RX buffer first
    while (SerialUART.available()) {
      SerialUART.read();
    }
    
    // Send packet
    SerialUART.write(query_packet, sizeof(query_packet));
    
    // Wait up to 250ms for response
    unsigned long start = millis();
    bool got_response = false;
    uint8_t rx_buf[64];
    size_t rx_len = 0;
    
    while (millis() - start < 250) {
      if (SerialUART.available()) {
        uint8_t b = SerialUART.read();
        if (rx_len == 0 && b != 0xA5) {
          continue; // Wait for SOF
        }
        rx_buf[rx_len++] = b;
        
        // Minimum packet length is 5
        if (rx_len >= 5) {
          uint8_t cmd = rx_buf[1];
          uint8_t protocol_len = rx_buf[2];
          uint8_t payload_len = protocol_len - 1;
          
          if (rx_len >= (size_t)(5 + payload_len)) {
            // Check checksum and EOF
            uint16_t sum = cmd + protocol_len;
            for (int i = 0; i < payload_len; i++) {
              sum += rx_buf[3 + i];
            }
            
            if ((sum & 0xFF) == rx_buf[3 + payload_len] && 
                rx_buf[4 + payload_len] == 0x5A) {
              
              if (cmd == 0x89) {
                // Valid model response!
                char model_str[32] = {0};
                memcpy(model_str, rx_buf + 3, payload_len);
                device_code = String(model_str);
                ble_name = device_code;
                
                // Save to NVS
                preferences.putString("model", device_code);
                DEBUG_PRINTF("Cihaz modeli basariyla alindi ve hafizaya kaydedildi: %s\n", device_code.c_str());
                got_response = true;
                break;
              }
            }
            // If it was another command or failed verification, reset buffer to find next 0xA5
            rx_len = 0;
          }
        }
      }
      delay(1);
    }
    
    if (got_response) {
      preferences.end();
      return;
    }
  }
  
  // If we reach here, all 10 retries failed
  device_code = "UNKNOWN";
  ble_name = "UNKNOWN";
  DEBUG_PRINTLN("MCU'dan model yaniti alinamadi! Cihaz modeli UNKNOWN olarak devam ediyor.");
  preferences.end();
}

// Cihaz Bilgisi Hazırlama
void initDeviceId() {
  uint64_t chipid = ESP.getEfuseMac();
  char idStr[32];
  sprintf(idStr, "%llu", chipid);
  device_id = String(idStr);

  preferences.begin("onloi", true); // Open in read-only mode
  device_code = preferences.getString("model", "UNKNOWN");
  preferences.end();

  ble_name = device_code;
  
  DEBUG_PRINT("Unique Device ID: ");
  DEBUG_PRINTLN(device_id);
  DEBUG_PRINT("Device Model Code: ");
  DEBUG_PRINTLN(device_code);
  DEBUG_PRINT("BLE Name: ");
  DEBUG_PRINTLN(ble_name);
}

// CRC16-CCITT
uint16_t calculate_crc16(const uint8_t *data, size_t length) {
  uint16_t crc = 0xFFFF;
  for (size_t i = 0; i < length; i++) {
    crc ^= (data[i] << 8);
    for (int j = 0; j < 8; j++) {
      if (crc & 0x8000) {
        crc = (crc << 1) ^ 0x1021;
      } else {
        crc <<= 1;
      }
    }
  }
  return crc;
}

// HMAC-SHA256
bool verify_hmac(const uint8_t *data, size_t data_len, const uint8_t *expected_auth_tag) {
  uint8_t hash[32];
  mbedtls_md_context_t ctx;
  mbedtls_md_init(&ctx);
  mbedtls_md_setup(&ctx, mbedtls_md_info_from_type(MBEDTLS_MD_SHA256), 1);

  size_t key_len = device_secret.length();
  uint8_t key[64];
  if (key_len == 64) {
    for (size_t i = 0; i < 32; i++) {
      String hexPart = device_secret.substring(i * 2, i * 2 + 2);
      key[i] = (uint8_t)strtol(hexPart.c_str(), NULL, 16);
    }
    key_len = 32;
  } else {
    memcpy(key, device_secret.c_str(), key_len);
  }

  mbedtls_md_hmac_starts(&ctx, key, key_len);
  mbedtls_md_hmac_update(&ctx, data, data_len);
  mbedtls_md_hmac_finish(&ctx, hash);
  mbedtls_md_free(&ctx);

  return memcmp(hash, expected_auth_tag, 8) == 0;
}

// MQTT Gönderim
void publish_mqtt_frame(uint8_t msg_type, uint8_t cmd, const uint8_t *payload, uint16_t payload_len, const String &topic, bool retain = false) {
  if (!mqtt_connected || mqtt_client == NULL) {
    DEBUG_PRINTF("[MQTT TX HATA] Sunucu baglantisi yok! CMD: 0x%02X, Topic: %s verisi gonderilemedi.\n", cmd, topic.c_str());
    return;
  }

  uint8_t frame[512];
  frame[0] = SOF_BYTE;
  frame[1] = VER_BYTE;
  frame[2] = msg_type;
  frame[3] = cmd;

  uint16_t seq = mqtt_seq++;
  frame[4] = (seq >> 8) & 0xFF;
  frame[5] = seq & 0xFF;

  frame[6] = (payload_len >> 8) & 0xFF;
  frame[7] = payload_len & 0xFF;

  frame[8] = 0x00; // STATUS

  struct timeval tv;
  gettimeofday(&tv, NULL);
  uint64_t ts = 0;
  if (tv.tv_sec > 1600000000) {
    ts = (uint64_t)tv.tv_sec * 1000ULL + (tv.tv_usec / 1000ULL);
  }
  for (int i = 0; i < 8; i++) {
    frame[9 + i] = (ts >> (56 - i * 8)) & 0xFF;
  }

  if (payload_len > 0 && payload != NULL) {
    memcpy(frame + 17, payload, payload_len);
  }

  uint16_t crc = calculate_crc16(frame, 17 + payload_len);
  frame[17 + payload_len] = (crc >> 8) & 0xFF;
  frame[17 + payload_len + 1] = crc & 0xFF;

  size_t total_len = 19 + payload_len;
  esp_mqtt_client_publish(mqtt_client, topic.c_str(), (const char*)frame, total_len, 1, retain);
  
  DEBUG_PRINTF("[MQTT TX] Topic: %s, CMD: 0x%02X, Seq: %d, Len: %d\n", topic.c_str(), cmd, seq, total_len);
}

void send_mqtt_ack(uint32_t requestId, uint8_t ackPhase, uint8_t cmdEcho, uint8_t detailCode) {
  uint8_t payload[7];
  payload[0] = (requestId >> 24) & 0xFF;
  payload[1] = (requestId >> 16) & 0xFF;
  payload[2] = (requestId >> 8) & 0xFF;
  payload[3] = requestId & 0xFF;
  payload[4] = ackPhase;
  payload[5] = cmdEcho;
  payload[6] = detailCode;

