buraky36/Barfas_Projects/myProjects/1_Access_Control_Terminal/Docs/ESP32_BLE_Wifi_V201/ESP32_BLE_Wifi_V201.ino
  publish_mqtt_frame(MSG_TYPE_ACK, CMD_ACK, payload, 7, topic_ack);
}

// MQTT İşleyicileri
void handle_mqtt_command(uint8_t cmd, uint16_t seq, const uint8_t *payload, uint16_t payload_len) {
  DEBUG_PRINTF("[MQTT CMD] CMD: 0x%02X, Len: %d\n", cmd, payload_len);

  uint32_t requestId = 0;
  if (payload_len >= 4) {
    requestId = (payload[0] << 24) | (payload[1] << 16) | (payload[2] << 8) | payload[3];
  }

  switch (cmd) {
    case CMD_REMOTE_OPEN: {
      DEBUG_PRINTLN("Sunucudan UZAKTAN AÇMA Komutu Alındı");
      send_mqtt_ack(requestId, 0x01, CMD_REMOTE_OPEN, 0x00); // RECEIVED
      
      remote_open_request_id = requestId;
      Remote_Open = true;
      remoteOpenTimestamp = millis();

      // STM32'ye UART üzerinden A5 40 01 41 5A şeklinde kapı açma isteği gönder
      sendSTM32Packet(0x40, NULL, 0);
      
      send_mqtt_ack(requestId, 0x02, CMD_REMOTE_OPEN, 0x00); // EXECUTING
      break;
    }
    case CMD_FACTORY_RESET: {
      DEBUG_PRINTLN("Sunucudan FABRİKA AYARLARINA SIFIRLAMA Komutu Alındı");
      send_mqtt_ack(requestId, 0x03, CMD_FACTORY_RESET, 0x00); // COMPLETED
      delay(1000);
      clearOnloiConfig();
      clearWiFiCredentials();
      ESP.restart();
      break;
    }
    case CMD_FP_ENROLL_START: {
      DEBUG_PRINTLN("Sunucudan PARMAK İZİ KAYDET Komutu Alındı");
      active_fp_enroll_request_id = requestId;
      send_mqtt_ack(requestId, 0x01, CMD_FP_ENROLL_START, 0x00);
      
      uint8_t ev_payload[4];
      ev_payload[0] = (requestId >> 24) & 0xFF;
      ev_payload[1] = (requestId >> 16) & 0xFF;
      ev_payload[2] = (requestId >> 8) & 0xFF;
      ev_payload[3] = requestId & 0xFF;
      publish_mqtt_frame(MSG_TYPE_EVENT, 0x24, ev_payload, 4, topic_event); // FP_ENROLL_READY

      // MCU'ya 0x46 komutunu gönder (A5 46 01 47 5A)
      sendSTM32Packet(CMD_FP_ENROLL_START, NULL, 0);
      break;
    }
    case CMD_CARD_ENROLL_START: {
      DEBUG_PRINTLN("Sunucudan KART KAYDET Komutu Alındı");
      active_nfc_enroll_request_id = requestId;
      send_mqtt_ack(requestId, 0x01, CMD_CARD_ENROLL_START, 0x00);

      // MCU'ya 0x47 komutunu gönder (A5 47 01 48 5A)
      sendSTM32Packet(CMD_CARD_ENROLL_START, NULL, 0);
      break;
    }
    default:
      break;
  }
}

void handle_mqtt_response(uint8_t cmd, uint16_t seq, uint8_t status, const uint8_t *payload, uint16_t payload_len) {
  DEBUG_PRINTF("[MQTT RESP] CMD: 0x%02X, Status: 0x%02X\n", cmd, status);

  switch (cmd) {
    case CMD_PIN_ENTERED:
    case CMD_NFC_SCANNED:
    case CMD_BUTTON_UNLOCK_REQ:
    case CMD_FINGERPRINT_SCANNED:
    case CMD_QR_SCANNED: {
      if (pending_mcu_cmd == cmd && seq == pending_mcu_seq) {
        uint8_t status_code = (status == 0x00) ? 0x00 : 0x01; // 0x00: onay, 0x01: red
        sendSTM32Packet(cmd, &status_code, 1);
        pending_mcu_cmd = 0; // Clear pending
      } else {
        // Fallback to legacy/original behavior
        if (status == 0x00) {
          DEBUG_PRINTLN("Erişim İzni Sunucu Tarafından Onaylandı! Kilit Açılıyor.");
          uint8_t status_open = 0x01;
          sendSTM32Packet(0x40, &status_open, 1);
        } else {
          DEBUG_PRINTLN("Erişim Sunucu Tarafından Reddedildi!");
          uint8_t status_deny = 0x00;
          sendSTM32Packet(0x40, &status_deny, 1);
        }
      }
      break;
    }
    case CMD_TIME_SYNC: {
      if (status == 0x00 && payload_len >= 8) {
        uint64_t unixMs = 0;
        for (int i = 0; i < 8; i++) {
          unixMs = (unixMs << 8) | payload[i];
        }
        serverEpoch = (time_t)(unixMs / 1000ULL);
        serverMillis = unixMs;

        struct timeval tv = {.tv_sec = serverEpoch, .tv_usec = 0};
        settimeofday(&tv, nullptr);
        DEBUG_PRINTF("Zaman Senkronizasyonu Başarılı: %s", ctime(&serverEpoch));

        uint8_t t_buf[4];
        uint32_t t_now = (uint32_t)serverEpoch;
        t_buf[0] = (t_now >> 24) & 0xFF;
        t_buf[1] = (t_now >> 16) & 0xFF;
        t_buf[2] = (t_now >> 8) & 0xFF;
        t_buf[3] = t_now & 0xFF;
        sendSTM32Packet(STM32_CMD_QUERY_TIME, t_buf, 4);
      }
      break;
    }
    case CMD_OFFLINE_LOG_BATCH: {
      if (status == 0x00 && payload_len >= 3) {
        uint16_t accepted = (payload[0] << 8) | payload[1];
        uint8_t err = payload[2];
        DEBUG_PRINTF("Çevrimdışı loglar sunucuya yazıldı. Adet: %d, Hata: %d\n", accepted, err);
        if (err == 0x00) {
          uint8_t resp_data[2] = {STM32_CMD_EVENT_LOG, STM32_RESP_OK};
          sendSTM32Packet(STM32_CMD_RESPONSE, resp_data, 2); // FIFO temizleme komutu
        }
      }
      break;
    }
    default:
      break;
  }
}

void process_mqtt_message(const char *topic, size_t topic_len, const char *data, size_t data_len) {
  if (data_len < 19) return;

  const uint8_t *frame = (const uint8_t *)data;
  if (frame[0] != SOF_BYTE || frame[1] != VER_BYTE) return;

  uint16_t payload_len = (frame[6] << 8) | frame[7];
  uint8_t msg_type = frame[2];
  uint8_t cmd = frame[3];
  uint16_t seq = (frame[4] << 8) | frame[5];
  uint8_t status = frame[8];

  size_t total_expected = 19 + payload_len;
  if (msg_type == MSG_TYPE_COMMAND) {
    total_expected += 8; // Komut paketlerinde 8 baytlık HMAC imzası eklenir
  }

  if (data_len < total_expected) return;

  uint16_t calculated;
  uint16_t received;

  if (msg_type == MSG_TYPE_COMMAND) {
    calculated = calculate_crc16(frame, 17 + payload_len + 8);
    received = (frame[17 + payload_len + 8] << 8) | frame[17 + payload_len + 8 + 1];
  } else {
    calculated = calculate_crc16(frame, 17 + payload_len);
    received = (frame[17 + payload_len] << 8) | frame[17 + payload_len + 1];
  }

  if (calculated != received) {
    DEBUG_PRINTF("[MQTT RX HATA] CRC Hatası! Alınan Uzunluk: %d, Beklenen Uzunluk: %d\n", data_len, total_expected);
    DEBUG_PRINTF("[MQTT RX HATA] Hesaplanan CRC: 0x%04X, Gelen CRC: 0x%04X\n", calculated, received);
    DEBUG_PRINT("[MQTT RX HATA] Gelen Baytlar: ");
    for (size_t i = 0; i < data_len; i++) {
      DEBUG_PRINTF("%02X ", frame[i]);
    }
    DEBUG_PRINTLN();
    return;
  }

  if (msg_type == MSG_TYPE_COMMAND) {
    // Komut paketlerinde payload_len doğrudan gerçek payload uzunluğudur.
    // HMAC imzası (8 bayt) ise payload'un hemen ardındadır.
    const uint8_t *auth_tag_ptr = frame + 17 + payload_len;

