buraky36/Barfas_Projects/myProjects/1_Access_Control_Terminal/Docs/ESP32_BLE_Wifi_V201/ESP32_BLE_Wifi_V201.ino
    bool verified = verify_hmac(frame, 17 + payload_len, auth_tag_ptr);
    if (!verified) {
      DEBUG_PRINTLN("MQTT Komut HMAC Doğrulaması Başarısız! (GEÇİCİ OLARAK BYPASS EDİLDİ)");
      ////////////////////////////////////////////////  hmac doğrulama kapatıldı.
      /*
      uint32_t reqId = 0;
      if (payload_len >= 4) {
        reqId = (frame[17] << 24) | (frame[18] << 16) | (frame[19] << 8) | frame[20];
      }
      send_mqtt_ack(reqId, 0x04, cmd, 0x01); // FAILED (Unauthorized)
      return;
      */
    }

    handle_mqtt_command(cmd, seq, frame + 17, payload_len);
  } else {
    handle_mqtt_response(cmd, seq, status, frame + 17, payload_len);
  }
}

void on_mqtt_connect() {
  uint8_t reg_payload[3];
  reg_payload[0] = (session_epoch >> 8) & 0xFF;
  reg_payload[1] = session_epoch & 0xFF;
  reg_payload[2] = 0x00; // status OK
  publish_mqtt_frame(MSG_TYPE_EVENT, CMD_REGISTRATION, reg_payload, 3, topic_lifecycle, true);

  uint8_t sess_payload[3];
  sess_payload[0] = 0x01; // wakeReason button
  sess_payload[1] = 85;   // default 85%
  sess_payload[2] = 0x00;
  publish_mqtt_frame(MSG_TYPE_EVENT, CMD_SESSION_START, sess_payload, 3, topic_lifecycle, true);

  publish_mqtt_frame(MSG_TYPE_REQUEST, CMD_TIME_SYNC, NULL, 0, topic_cmd);
}

static void mqtt_event_handler(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data) {
  esp_mqtt_event_handle_t event = (esp_mqtt_event_handle_t)event_data;
  switch (event->event_id) {
    case MQTT_EVENT_CONNECTED:
      DEBUG_PRINTLN("[MQTT] Sunucu baglantisi BASARILI! Abonelikler olusturuluyor...");
      mqtt_connected = true;
      esp_mqtt_client_subscribe(mqtt_client, topic_cmd.c_str(), 1);
      esp_mqtt_client_subscribe(mqtt_client, topic_reply.c_str(), 1);
      esp_mqtt_client_subscribe(mqtt_client, topic_config.c_str(), 1);
      on_mqtt_connect();
      break;
    case MQTT_EVENT_DISCONNECTED:
      DEBUG_PRINTLN("[MQTT] Sunucu baglantisi KESILDI veya BAGLANILAMADI!");
      mqtt_connected = false;
      break;
    case MQTT_EVENT_DATA:
      process_mqtt_message(event->topic, event->topic_len, event->data, event->data_len);
      break;
    case MQTT_EVENT_ERROR:
      DEBUG_PRINTLN("[MQTT] Hata olayi tetiklendi!");
      break;
    default:
      break;
  }
}

void start_mqtt() {
  if (mqtt_client != NULL) return;

  topic_cmd = "onloi/v1/d/" + device_id + "/cmd";
  topic_reply = "onloi/v1/d/" + device_id + "/reply";
  topic_config = "onloi/v1/d/" + device_id + "/config";
  topic_lifecycle = "onloi/v1/d/" + device_id + "/lifecycle";
  topic_telemetry = "onloi/v1/d/" + device_id + "/telemetry";
  topic_event = "onloi/v1/d/" + device_id + "/event";
  topic_log = "onloi/v1/d/" + device_id + "/log";
  topic_ack = "onloi/v1/d/" + device_id + "/ack";

  esp_mqtt_client_config_t mqtt_cfg = {};

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  mqtt_cfg.broker.address.hostname = mqtt_host.c_str();
  mqtt_cfg.broker.address.port = mqtt_port;
  if (mqtt_port == 8883 || mqtt_port == 8884 || mqtt_port == 443) {
    mqtt_cfg.broker.address.transport = MQTT_TRANSPORT_OVER_SSL;
    mqtt_cfg.broker.verification.crt_bundle_attach = esp_crt_bundle_attach;
  } else {
    mqtt_cfg.broker.address.transport = MQTT_TRANSPORT_OVER_TCP;
  }

  mqtt_cfg.credentials.client_id = mqtt_client_id.c_str();
  mqtt_cfg.credentials.username = mqtt_user.c_str();
  mqtt_cfg.credentials.authentication.password = mqtt_pass.c_str();
  mqtt_cfg.session.keepalive = 30;
  mqtt_cfg.session.disable_clean_session = false;
  mqtt_cfg.session.last_will.topic = topic_lifecycle.c_str();
  mqtt_cfg.session.last_will.msg = "";
  mqtt_cfg.session.last_will.msg_len = 0;
  mqtt_cfg.session.last_will.qos = 1;
  mqtt_cfg.session.last_will.retain = true;
#else
  mqtt_cfg.host = mqtt_host.c_str();
  mqtt_cfg.port = mqtt_port;
  if (mqtt_port == 8883 || mqtt_port == 8884 || mqtt_port == 443) {
    mqtt_cfg.transport = MQTT_TRANSPORT_OVER_SSL;
    mqtt_cfg.crt_bundle_attach = esp_crt_bundle_attach;
  } else {
    mqtt_cfg.transport = MQTT_TRANSPORT_OVER_TCP;
  }
  mqtt_cfg.client_id = mqtt_client_id.c_str();
  mqtt_cfg.username = mqtt_user.c_str();
  mqtt_cfg.password = mqtt_pass.c_str();
  mqtt_cfg.keepalive = 30;
  mqtt_cfg.disable_clean_session = 0;
  mqtt_cfg.lwt_topic = topic_lifecycle.c_str();
  mqtt_cfg.lwt_msg = "";
  mqtt_cfg.lwt_msg_len = 0;
  mqtt_cfg.lwt_qos = 1;
  mqtt_cfg.lwt_retain = 1;
#endif

  DEBUG_PRINTF("[MQTT] Sunucuya baglanma baslatiliyor... Host: %s, Port: %d\n", mqtt_host.c_str(), mqtt_port);
  DEBUG_PRINTF("[MQTT DETAY] ClientID: %s, User: %s, Pass: %s, Secret: %s\n",
               mqtt_client_id.c_str(), mqtt_user.c_str(), mqtt_pass.c_str(), device_secret.c_str());
  mqtt_client = esp_mqtt_client_init(&mqtt_cfg);
  esp_mqtt_client_register_event(mqtt_client, (esp_mqtt_event_id_t)ESP_EVENT_ANY_ID, mqtt_event_handler, NULL);
  esp_mqtt_client_start(mqtt_client);
}

// HTTPS Claim İşlemi
bool execute_claim() {
  String prov_token = loadProvisionToken();
  DEBUG_PRINTF("Claim için yüklenen provision token: %s\n", prov_token.c_str());
  if (prov_token.length() == 0) {
    DEBUG_PRINTLN("Claim için geçerli bir provision token bulunamadı.");
    return false;
  }

  StaticJsonDocument<256> doc;
  doc["deviceId"] = device_id;
  doc["deviceCode"] = device_code;
  doc["provisioningToken"] = prov_token;

  String body;
  serializeJson(doc, body);
  DEBUG_PRINTF("Claim istek gövdesi (Body): %s\n", body.c_str());

  HTTPClient http;
  http.begin(client, CLAIM_URL);
  http.addHeader("Content-Type", "application/json");

  DEBUG_PRINTF("HTTPS Claim isteği gönderiliyor... Hedef URL: %s\n", CLAIM_URL);
  int code = http.POST(body);
  String payload = http.getString();
  http.end();

  DEBUG_PRINTF("Claim HTTP Kodu: %d, Yanıt: %s\n", code, payload.c_str());

  if (code == 200) {
    StaticJsonDocument<1024> res;
    DeserializationError err = deserializeJson(res, payload);
    if (!err) {
      String host = res["mqtt"]["host"];
      uint16_t port = res["mqtt"]["port"];
      String clientId = res["mqtt"]["clientId"];
      String username = res["mqtt"]["username"];
      String password = res["mqtt"]["password"];
      String secret = res["deviceSecret"];
      uint16_t epoch = res["sessionEpoch"];

      saveOnloiConfig(host, port, clientId, username, password, secret, epoch);
      saveProvisionToken(""); // Tokenı temizle
      DEBUG_PRINTLN("[CLAIM SUCCESS] Sunucudan MQTT bilgileri alindi ve kaydedildi!");
      DEBUG_PRINTF("[CLAIM DETAY] Host: %s, Port: %d, ClientID: %s, User: %s, Pass: %s, Secret: %s, Epoch: %d\n",
                   host.c_str(), port, clientId.c_str(), username.c_str(), password.c_str(), secret.c_str(), epoch);
      return true;
    } else {
      DEBUG_PRINTLN("[CLAIM ERROR] Sunucu yaniti JSON parse hatasi!");
    }
  } else {
    DEBUG_PRINTF("[CLAIM ERROR] HTTP POST hatasi veya gecersiz token! Kod: %d, Yanit: %s\n", code, payload.c_str());
  }
  return false;
}

// BLE Binary Komut İşleme
void handle_ble_command(uint8_t cmd, uint16_t seq, const uint8_t *payload, uint16_t payload_len) {
  DEBUG_PRINTF("[BLE RX] CMD: 0x%02X, Seq: %d, Len: %d\n", cmd, seq, payload_len);
  switch (cmd) {
    case CMD_HANDSHAKE: {
      uint8_t resp_payload[24] = {0};
      memcpy(resp_payload, device_id.c_str(), min((size_t)16, device_id.length()));
      
      char code_buf[8] = {0};
      strncpy(code_buf, device_code.c_str(), sizeof(code_buf) - 1);
      memcpy(resp_payload + 16, code_buf, 8);
      
      send_ble_response(CMD_HANDSHAKE, seq, 0x00, resp_payload, 24);
      break;
    }
    case CMD_PROVISION: {
      if (payload_len >= 32) {
        char token_hex[65];
        for (int i = 0; i < 32; i++) {
          sprintf(token_hex + (i * 2), "%02X", payload[i]);
        }
        saveProvisionToken(String(token_hex));
        DEBUG_PRINTF("Provision token kaydedildi: %s\n", token_hex);

        uint8_t result = 0x00; // Başarılı
        send_ble_response(CMD_PROVISION, seq, 0x00, &result, 1);
      } else {
        uint8_t result = 0x01; // Başarısız
        send_ble_response(CMD_PROVISION, seq, 0x00, &result, 1);
      }
      break;
    }
    case CMD_GET_SSIDS: {
      DEBUG_PRINTLN("Wi-Fi ağ taraması yapılıyor...");
      WiFi.mode(WIFI_STA);
      WiFi.disconnect(true);
      delay(100);
      int n = WiFi.scanNetworks();
      DEBUG_PRINTF("Tarama bitti: %d ağ bulundu\n", n);

