buraky36/Barfas_Projects/myProjects/1_Access_Control_Terminal/Docs/ESP32_BLE_Wifi_V201/ESP32_BLE_Wifi_V201.ino
      uint8_t scan_payload[512];
      uint8_t count = min(n, 10); // Maksimum 10 ağ dönecek
      scan_payload[0] = 0;
      size_t offset = 1;
      uint8_t added_count = 0;

      for (int i = 0; i < count; i++) {
        String ssid = WiFi.SSID(i);
        uint8_t ssid_len = min((size_t)32, ssid.length());

        // Taşma kontrolü: BSSID(6) + RSSI(1) + Channel(1) + Len(1) + SSID(ssid_len)
        if (offset + 9 + ssid_len > sizeof(scan_payload)) {
          break;
        }

        uint8_t bssid[6];
        uint8_t *bssid_ptr = WiFi.BSSID(i);
        if (bssid_ptr != NULL) {
          memcpy(bssid, bssid_ptr, 6);
        } else {
          memset(bssid, 0, 6);
        }
        memcpy(scan_payload + offset, bssid, 6);
        offset += 6;

        int8_t rssi = WiFi.RSSI(i);
        scan_payload[offset++] = (uint8_t)rssi;

        int channel = WiFi.channel(i);
        scan_payload[offset++] = (channel < 15) ? 0x01 : 0x02; // 2.4 vs 5

        scan_payload[offset++] = ssid_len;

        memcpy(scan_payload + offset, ssid.c_str(), ssid_len);
        offset += ssid_len;

        added_count++;

        DEBUG_PRINTF("[WiFi Tarama] Ag #%d: SSID: \"%s\", RSSI: %d dBm, Kanal: %d, BSSID: %02X:%02X:%02X:%02X:%02X:%02X\n",
                     i + 1, ssid.c_str(), rssi, channel,
                     bssid[0], bssid[1], bssid[2], bssid[3], bssid[4], bssid[5]);
      }
      scan_payload[0] = added_count;

      send_ble_response(CMD_GET_SSIDS, seq, 0x00, scan_payload, offset);
      WiFi.scanDelete();
      break;
    }
    case CMD_CONNECT_WIFI: {
      if (payload_len >= 8) {
        uint8_t ssid_len = payload[0];
        char ssid[33] = {0};
        memcpy(ssid, payload + 1, min((int)ssid_len, 32));

        size_t pass_offset = 1 + ssid_len + 6;
        uint8_t pass_len = payload[pass_offset];
        char pass[65] = {0};
        memcpy(pass, payload + pass_offset + 1, min((int)pass_len, 64));

        DEBUG_PRINTF("Bağlanılıyor: SSID=%s, Sifre=%s\n", ssid, pass);
        if (connectToWiFi(ssid, pass)) {
          wifiConnected = true;
          saveWiFiCredentials(ssid, pass);

          uint8_t result = 0x00; // Başarılı
          send_ble_response(CMD_CONNECT_WIFI, seq, 0x00, &result, 1);
          shouldStopBLE = true;
        } else {
          uint8_t result = 0x01; // Başarısız
          send_ble_response(CMD_CONNECT_WIFI, seq, 0x00, &result, 1);
        }
      }
      break;
    }
    default:
      break;
  }
}

void send_ble_response(uint8_t cmd, uint16_t seq, uint8_t status, const uint8_t *payload, uint16_t payload_len) {
  if (payload_len > 490) {
    payload_len = 490; // Bellek sınırını aşmasını engelle
  }
  uint8_t resp[512];
  resp[0] = SOF_BYTE;
  resp[1] = VER_BYTE;
  resp[2] = MSG_TYPE_RESPONSE;
  resp[3] = cmd;
  resp[4] = (seq >> 8) & 0xFF;
  resp[5] = seq & 0xFF;
  resp[6] = (payload_len >> 8) & 0xFF;
  resp[7] = payload_len & 0xFF;
  resp[8] = status;

  uint64_t ts = 0;
  struct timeval tv;
  gettimeofday(&tv, NULL);
  if (tv.tv_sec > 1600000000) {
    ts = (uint64_t)tv.tv_sec * 1000ULL + (tv.tv_usec / 1000ULL);
  }
  for (int i = 0; i < 8; i++) {
    resp[9 + i] = (ts >> (56 - i * 8)) & 0xFF;
  }

  if (payload_len > 0 && payload != NULL) {
    memcpy(resp + 17, payload, payload_len);
  }

  uint16_t crc = calculate_crc16(resp, 17 + payload_len);
  resp[17 + payload_len] = (crc >> 8) & 0xFF;
  resp[17 + payload_len + 1] = crc & 0xFF;

  size_t total_len = 19 + payload_len;

  DEBUG_PRINT("[BLE TX FRAME] ");
  for (size_t i = 0; i < total_len; i++) {
    DEBUG_PRINTF("%02X ", resp[i]);
  }
  DEBUG_PRINTLN();

  const size_t MTU_CHUNK = 19;
  for (size_t pos = 0; pos < total_len; pos += MTU_CHUNK) {
    size_t chunkSize = min(MTU_CHUNK, total_len - pos);
    pCharacteristicTX->setValue(resp + pos, chunkSize);
    pCharacteristicTX->notify();
    delay(50);
  }
}

class MyCallbacks : public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *pChar) override {
    String rx = pChar->getValue();
    size_t len = rx.length();

    DEBUG_PRINT("[BLE RX RAW CHUNK] ");
    for (size_t i = 0; i < len; i++) {
      DEBUG_PRINTF("%02X ", (uint8_t)rx[i]);
    }
    DEBUG_PRINTLN();

    if (ble_rx_len + len > sizeof(ble_rx_buffer)) {
      ble_rx_len = 0;
    }
    memcpy(ble_rx_buffer + ble_rx_len, rx.c_str(), len);
    ble_rx_len += len;

    while (ble_rx_len >= 19) {
      size_t sof_idx = 0;
      while (sof_idx < ble_rx_len && ble_rx_buffer[sof_idx] != SOF_BYTE) {
        sof_idx++;
      }
      if (sof_idx > 0) {
        memmove(ble_rx_buffer, ble_rx_buffer + sof_idx, ble_rx_len - sof_idx);
        ble_rx_len -= sof_idx;
        continue;
      }

      if (ble_rx_buffer[1] != VER_BYTE) {
        memmove(ble_rx_buffer, ble_rx_buffer + 1, --ble_rx_len);
        continue;
      }

      uint16_t payload_len = (ble_rx_buffer[6] << 8) | ble_rx_buffer[7];
      size_t total_expected = 19 + payload_len;

      if (ble_rx_len < total_expected) {
        break;
      }

      uint16_t calculated = calculate_crc16(ble_rx_buffer, 17 + payload_len);
      uint16_t received = (ble_rx_buffer[17 + payload_len] << 8) | ble_rx_buffer[17 + payload_len + 1];

      if (calculated != received) {
        DEBUG_PRINTLN("[BLE] CRC Uyuşmazlığı!");
        memmove(ble_rx_buffer, ble_rx_buffer + 1, --ble_rx_len);
        continue;
      }

      DEBUG_PRINT("[BLE RX FRAME] ");
      for (size_t i = 0; i < total_expected; i++) {
        DEBUG_PRINTF("%02X ", ble_rx_buffer[i]);
      }
      DEBUG_PRINTLN();

      uint8_t cmd = ble_rx_buffer[3];
      uint16_t seq = (ble_rx_buffer[4] << 8) | ble_rx_buffer[5];
      uint8_t *payload = ble_rx_buffer + 17;

      handle_ble_command(cmd, seq, payload, payload_len);

      memmove(ble_rx_buffer, ble_rx_buffer + total_expected, ble_rx_len - total_expected);
      ble_rx_len -= total_expected;
    }
  }
};

class MyServerCallbacks : public BLEServerCallbacks {
  void onConnect(BLEServer *pServer) override {
    deviceConnected = true;
    DEBUG_PRINTLN("🔌 BLE bağlandı.");
    delay(100);
  }

  void onDisconnect(BLEServer *pServer) override {
    deviceConnected = false;
    DEBUG_PRINTLN("🔌 BLE bağlantısı kesildi.");
    BLEDevice::startAdvertising();
  }
};

