buraky36/Barfas_Projects/myProjects/1_Access_Control_Terminal/Docs/ESP32_BLE_Wifi_V201/ESP32_BLE_Wifi_V201.ino
void startBLE() {
  BLEDevice::init(ble_name.c_str());
  BLEServer *pServer = BLEDevice::createServer();
  pServer->setCallbacks(new MyServerCallbacks());

  BLEService *pService = pServer->createService(SERVICE_UUID);

  // RX karakteristiği oluştur
  BLECharacteristic *pCharacteristicRX = pService->createCharacteristic(
      CHARACTERISTIC_UUID_RX, BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR);
  pCharacteristicRX->setCallbacks(new MyCallbacks());

  // TX karakteristiği oluştur (ESP32'den mobil uygulamaya giden bildirimler için)
  pCharacteristicTX = pService->createCharacteristic(
      CHARACTERISTIC_UUID_TX, BLECharacteristic::PROPERTY_NOTIFY);
  pCharacteristicTX->addDescriptor(new BLE2902());

  pService->start();

  BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();

  BLEAdvertisementData oAdvertisementData = BLEAdvertisementData();
  oAdvertisementData.setFlags(0x06);
  oAdvertisementData.setCompleteServices(BLEUUID(SERVICE_UUID));
  pAdvertising->setAdvertisementData(oAdvertisementData);

  BLEAdvertisementData oScanResponseData = BLEAdvertisementData();
  oScanResponseData.setName(ble_name.c_str());
  pAdvertising->setScanResponseData(oScanResponseData);

  pAdvertising->setMinPreferred(0x06);
  pAdvertising->setMaxPreferred(0x12);

  BLEDevice::startAdvertising();
  bleMode = true;
  DEBUG_PRINTLN("BLE Ayarlandı ve Reklam Yayını Başlatıldı!");
}

bool connectToWiFi(const char *ssid, const char *password) {
  DEBUG_PRINT("WiFi Bağlanılıyor: ");
  DEBUG_PRINTLN(ssid);
  WiFi.begin(ssid, password);
  unsigned long startTime = millis();

  while (WiFi.status() != WL_CONNECTED && (millis() - startTime) < 15000) {
    delay(500);
    DEBUG_PRINT(".");
  }
  if (WiFi.status() == WL_CONNECTED) {
    DEBUG_PRINTLN("\nWiFi Bağlantısı Başarılı!");
    DEBUG_PRINT("Yerel IP: ");
    DEBUG_PRINTLN(WiFi.localIP());
    bleMode = false;
    return true;
  } else {
    DEBUG_PRINTLN("\nWiFi Bağlantısı Başarısız!");
    return false;
  }
}

bool loadWiFiCredentials(String &ssid, String &pass) {
  preferences.begin("wifi", true);
  ssid = preferences.getString("ssid", "");
  pass = preferences.getString("pass", "");
  preferences.end();
  return ssid.length() > 0 && pass.length() > 0;
}

void saveWiFiCredentials(const char *ssid, const char *pass) {
  preferences.begin("wifi", false);
  preferences.putString("ssid", ssid);
  preferences.putString("pass", pass);
  preferences.end();
}

void clearWiFiCredentials() {
  preferences.begin("wifi", false);
  preferences.clear();
  preferences.end();
}

void factoryReset() {
  clearWiFiCredentials();
  clearOnloiConfig();
  ESP.restart();
}

// 55AA Eski Protokol Ayrıştırıcı
bool parseNextFrame(Frame *out) {
  if (stream_len < 7) return false;

  size_t i;
  for (i = 0; i + 1 < stream_len; ++i) {
    if (stream_buf[i] == 0x55 && stream_buf[i + 1] == 0xAA)
      break;
  }
  if (i + 1 >= stream_len) {
    stream_len = 0;
    return false;
  }
  if (i) {
    memmove(stream_buf, stream_buf + i, stream_len - i);
    stream_len -= i;
  }
  if (stream_len < 7) return false;

  out->header = (stream_buf[0] << 8) | stream_buf[1];
  out->version = stream_buf[2];
  out->command = stream_buf[3];
  out->length = (stream_buf[4] << 8) | stream_buf[5];

  size_t full_len = 6 + out->length + 1;
  if (stream_len < full_len) return false;

  if (out->command == 0xDD) {
    if (out->length) {
      out->data = (uint8_t *)malloc(out->length + 1);
      for (size_t j = 0; j < out->length; ++j) {
        out->data[j] = stream_buf[6 + j] % 10;
      }
    } else {
      out->data = NULL;
    }
  } else {
    if (out->length) {
      out->data = (uint8_t *)malloc(out->length);
      memcpy(out->data, stream_buf + 6, out->length);
    } else {
      out->data = NULL;
    }
  }
  out->checksum = stream_buf[6 + out->length];

  uint32_t sum = 0;
  for (size_t j = 0; j < 6 + out->length; ++j)
    sum += stream_buf[j];
  if ((uint8_t)(sum & 0xFF) != out->checksum) {
    free(out->data);
    memmove(stream_buf, stream_buf + 2, --stream_len);
    return parseNextFrame(out);
  }

  memmove(stream_buf, stream_buf + full_len, stream_len - full_len);
  stream_len -= full_len;
  return true;
}

void processIncoming(const uint8_t *buf, size_t len) {
  if (stream_len + len > STREAM_SIZE) stream_len = 0;
  memcpy(stream_buf + stream_len, buf, len);
  stream_len += len;
}

void sendStatusUART(uint8_t status) {
  uint8_t packet[8] = {
      0x55, 0xAA, 0x00, 0xDD, 0x00, 0x01, status, 0x00
  };
  if (status == 0x01) {
    packet[7] = 0xDE;
  } else if (status == 0x00) {
    packet[7] = 0xDD;
  } else if (status == 0x05) {
    packet[7] = 0xE2;
  }

  DEBUG_PRINT(">>> [MCU TX RAW (55AA)] ");
  for (size_t i = 0; i < sizeof(packet); ++i) {
    DEBUG_PRINTF("%02X ", packet[i]);
  }
  DEBUG_PRINTLN();
  SerialUART.write(packet, sizeof(packet));
}

void sendNetworkStatus(uint8_t statusCode) {
  uint8_t buf[8];
  buf[0] = 0x55;
  buf[1] = 0xAA;
  buf[2] = Version;
  buf[3] = 0x02; // Wifi_Status
  buf[4] = 0x00;
  buf[5] = 0x01;
  buf[6] = statusCode;

  uint16_t sum = 0;
  for (int i = 0; i <= 6; ++i)
    sum += buf[i];
  buf[7] = sum & 0xFF;

  DEBUG_PRINT(">>> [MCU TX RAW (55AA)] ");
  for (size_t i = 0; i < sizeof(buf); ++i) {
    DEBUG_PRINTF("%02X ", buf[i]);
  }
  DEBUG_PRINTLN();
  SerialUART.write(buf, sizeof(buf));
}

void setup() {
  Serial.begin(115200);
  delay(100);

  WiFi.mode(WIFI_STA);
  initDeviceId();
  WiFi.setHostname(ble_name.c_str());

  pinMode(RX_PIN, INPUT_PULLUP);
  SerialUART.begin(BAUD_RATE, SERIAL_8N1, RX_PIN, TX_PIN);
  DEBUG_PRINTLN("UART1 Echo hazir. TX=17, RX=16, Baud=115200");

  // Query model name from MCU if not already known
  if (device_code == "UNKNOWN") {
    queryDeviceModelFromMCU();
    WiFi.setHostname(ble_name.c_str());
  }

  client.setInsecure(); // Geliştirme/test kolaylığı için TLS doğrulaması kapalı

  // Onloi ayarlarını yükle
  bool claimed = loadOnloiConfig();

  String savedSsid, savedPass;
  if (loadWiFiCredentials(savedSsid, savedPass)) {
    if (connectToWiFi(savedSsid.c_str(), savedPass.c_str())) {
      wifiConnected = true;
      
