buraky36/Barfas_Projects/myProjects/1_Access_Control_Terminal/Docs/ESP32_BLE_Wifi_V201/ESP32_BLE_Wifi_V201.ino
      // Eğer Claim yapılmamışsa, yap
      if (!claimed) {
        if (execute_claim()) {
          claimed = loadOnloiConfig(); // Tekrar yükle
        }
      }
      
      if (claimed) {
        start_mqtt();
      }

////////////////////////////////////////////////////// sil yukarıyı ekle
// YENİ - Test modu: claim olmadan direkt bağlan
//mqtt_host = "192.168.1.223";  // buraya PC'nin IP'sini yaz
//mqtt_port = 1883;
//mqtt_client_id = "onloi_" + device_id;
//mqtt_user = "";
//mqtt_pass = "";
//device_secret = "";

// Transport SSL yerine TCP yap
//start_mqtt();
////////////////////////////////////////////////////////

    }
  } else {
    startBLE();
  }
}

void loop() {
#ifdef ENABLE_SERIAL_TEST
  if (Serial.available()) {
    String input = Serial.readStringUntil('\n');
    input.trim();
    if (input.length() > 0) {
      if (input.startsWith("0x") || input.startsWith("0X")) {
        input = input.substring(2);
      }
      input.replace(" ", "");
      for (int i = 0; i < input.length(); i += 2) {
        String hexByte = input.substring(i, i + 2);
        uint8_t rawByte = (uint8_t)strtol(hexByte.c_str(), NULL, 16);
        SerialUART.write(rawByte);
        DEBUG_PRINTF("RAW TX (Test): %02X\n", rawByte);
      }
    }
  }
#endif

  unsigned long now = millis();

  // UZAKTAN AÇMA Zaman aşımı kontrolü
  if (Remote_Open && (now - remoteOpenTimestamp >= REMOTE_OPEN_LOCK_MS)) {
    Remote_Open = false;
    DEBUG_PRINTLN("Uzaktan açma süresi doldu.");
  }

  // MCU Erişim İsteği Zaman Aşımı Kontrolü (15 sn)
  if (pending_mcu_cmd != 0 && (now - pending_mcu_time >= 15000)) {
    DEBUG_PRINTF("[TIMEOUT] MCU komut zamanaşımı: 0x%02X\n", pending_mcu_cmd);
    uint8_t timeout_code = 0x02; // STATUS 0x02 = timeout
    sendSTM32Packet(pending_mcu_cmd, &timeout_code, 1);
    pending_mcu_cmd = 0;
  }

  // BLE Kapatma ve yeniden başlatma isteği
  if (shouldStopBLE) {
    delay(1000);
    DEBUG_PRINTLN("Wi-Fi bilgileri kaydedildi, cihaz yeniden başlatılıyor...");
    ESP.restart();
  }

  // Read all available bytes from SerialUART and feed both buffers (no block, no timeout)
  static unsigned long last_rx_time = 0;
  while (SerialUART.available()) {
    uint8_t c = SerialUART.read();
    
    // Group bytes by time delay to print on the same line (50ms gap starts a new line)
    unsigned long current_time = millis();
    if (current_time - last_rx_time > 50) {
      DEBUG_PRINT("\n[MCU RX RAW]: ");
    }
    DEBUG_PRINTF("%02X ", c);
    last_rx_time = current_time;
    
    // Feed to new protocol buffer (A5)
    if (stm32_buffer_len < sizeof(stm32_buffer)) {
      stm32_buffer[stm32_buffer_len++] = c;
    }
    
    // Feed to legacy protocol buffer (55 AA)
    if (stream_len < STREAM_SIZE) {
      stream_buf[stream_len++] = c;
    }
  }

  // UART Okuma ve STM32 ile haberleşme
  handleSTM32Commands();

  // Eski 55AA paketlerini yeni MQTT olaylarına köprüleme
  Frame f;
  while (parseNextFrame(&f)) {
    switch (f.command) {
      case Wifi_Reset2: {
        DEBUG_PRINTLN("WIFI RESET2 komutu tetiklendi!");
        resetWiFi();
        break;
      }
      case Log_State: {
        if (mqtt_connected) {
          uint8_t log_type = f.data[0];
          if (log_type == 0x31) { // Buton basımı ile açma talebi
            if (!Remote_Open) {
              uint8_t btn_payload[5] = {0x01, 0, 0, 0, 0};
              publish_mqtt_frame(MSG_TYPE_EVENT, CMD_BUTTON_UNLOCK_REQ, btn_payload, 5, topic_event);
            }
          } else if (log_type == 0x05) { // RFID Kart okundu
            uint8_t nfc_payload[9] = {4, 0x00, 0x00, 0x00, 0x00, 0, 0, 0, 0};
            if (f.length >= 5) {
              memcpy(nfc_payload + 1, f.data + 1, 4);
            }
            publish_mqtt_frame(MSG_TYPE_EVENT, CMD_NFC_SCANNED, nfc_payload, 9, topic_event);
          } else if (log_type == 0x01) { // Parmak izi okundu
            uint8_t fp_payload[6] = {0, 0, 0, 0, 0, 0};
            if (f.length >= 3) {
              fp_payload[0] = f.data[1];
              fp_payload[1] = f.data[2];
            }
            publish_mqtt_frame(MSG_TYPE_EVENT, CMD_FINGERPRINT_SCANNED, fp_payload, 6, topic_event);
          }
        }
        break;
      }
      case Temporary_Pass: {
        String Pass_Value;
        for (size_t i = 0; i < f.length; i++) {
          Pass_Value += char('0' + f.data[i]);
        }
        DEBUG_PRINTF("Şifre girişi yapıldı: %s\n", Pass_Value.c_str());

        if (mqtt_connected) {
          uint8_t pin_payload[15];
          uint8_t pin_len = min((size_t)10, Pass_Value.length());
          pin_payload[0] = pin_len;
          memcpy(pin_payload + 1, Pass_Value.c_str(), pin_len);
          uint32_t reqId = mqtt_seq;
          pin_payload[1 + pin_len] = (reqId >> 24) & 0xFF;
          pin_payload[1 + pin_len + 1] = (reqId >> 16) & 0xFF;
          pin_payload[1 + pin_len + 2] = (reqId >> 8) & 0xFF;
          pin_payload[1 + pin_len + 3] = reqId & 0xFF;

          publish_mqtt_frame(MSG_TYPE_EVENT, CMD_PIN_ENTERED, pin_payload, 1 + pin_len + 4, topic_event);
        } else {
          uint8_t status_deny = 0x00;
          sendSTM32Packet(0x40, &status_deny, 1);
        }
        break;
      }
      default:
        break;
    }
    free(f.data);
  }
}

void resetWiFi() {
  clearWiFiCredentials();
  clearOnloiConfig();
  WiFi.disconnect(true);
  ESP.restart();
}

// STM32 A5 Haberleşmesi
void handleSTM32Commands() {
  // stm32_buffer and stm32_buffer_len are now global variables

  if (stm32_buffer_len == 0) return;

  size_t start_idx = 0;
  while (start_idx < stm32_buffer_len && stm32_buffer[start_idx] != 0xA5) {
    start_idx++;
  }

  if (start_idx > 0) {
    stm32_buffer_len -= start_idx;
    if (stm32_buffer_len > 0)
      memmove(stm32_buffer, stm32_buffer + start_idx, stm32_buffer_len);
  }

  if (stm32_buffer_len < 5) return;

  uint8_t cmd = stm32_buffer[1];
  uint8_t protocol_len = stm32_buffer[2];
  if (protocol_len == 0) {
    stm32_buffer_len--;
    if (stm32_buffer_len > 0)
      memmove(stm32_buffer, stm32_buffer + 1, stm32_buffer_len);
    return;
  }

  uint8_t payload_len = protocol_len - 1;
  if (stm32_buffer_len < (size_t)(5 + payload_len)) return;

  uint16_t checksum = cmd + protocol_len;
  for (int i = 0; i < payload_len; i++) {
    checksum += stm32_buffer[3 + i];
  }

