buraky36/Barfas_Projects/myProjects/1_Access_Control_Terminal/Docs/ESP32_BLE_Wifi_V201/ESP32_BLE_Wifi_V201.ino
  if ((checksum & 0xFF) == stm32_buffer[3 + payload_len] &&
      stm32_buffer[4 + payload_len] == 0x5A) {



    const uint8_t *payload = &stm32_buffer[3];
    uint8_t len = payload_len;

    switch (cmd) {
      case STM32_CMD_BATTERY_REPORT: {
        if (len >= 1) {
          uint8_t prcnt = payload[0];
          DEBUG_PRINTF("🔋 Pil Seviyesi: %d%%\n", prcnt);

          if (mqtt_connected) {
            DEBUG_PRINTLN("[STM32 -> MQTT] Pil seviyesi sunucuya gonderiliyor...");
            publish_mqtt_frame(MSG_TYPE_EVENT, CMD_BATTERY_REPORT, &prcnt, 1, topic_telemetry);
            uint8_t resp_data[2] = {STM32_CMD_BATTERY_REPORT, STM32_RESP_OK};
            sendSTM32Packet(STM32_CMD_RESPONSE, resp_data, 2);
          } else {
            DEBUG_PRINTLN("[STM32 -> MQTT] Pil seviyesi sunucuya GONDERILEMEDI (MQTT Baglantisi Yok)!");
            uint8_t resp_data[2] = {STM32_CMD_BATTERY_REPORT, STM32_RESP_NO_WIFI};
            sendSTM32Packet(STM32_CMD_RESPONSE, resp_data, 2);
          }
        }
        break;
      }
      case STM32_CMD_QUERY_BATTERY: {
        if (len >= 2) {
          uint8_t prcnt = payload[0];
          DEBUG_PRINTF("🔋 Pil Seviyesi Sorgusu: %d%%\n", prcnt);
          if (mqtt_connected) {
            DEBUG_PRINTLN("[STM32 -> MQTT] Pil sorgu seviyesi sunucuya gonderiliyor...");
            publish_mqtt_frame(MSG_TYPE_EVENT, CMD_BATTERY_REPORT, &prcnt, 1, topic_telemetry);
          } else {
            DEBUG_PRINTLN("[STM32 -> MQTT] Pil sorgu seviyesi sunucuya GONDERILEMEDI (MQTT Baglantisi Yok)!");
          }
        }
        break;
      }
      case 0x11: { // CMD_LOCK_OPENED
        DEBUG_PRINTLN("🚪 Kapi Acildi Bildirimi alindi.");
        door_opened_confirmed = true;
        if (mqtt_connected) {
          DEBUG_PRINTLN("[STM32 -> MQTT] Kilit acilma olayi sunucuya bildiriliyor...");
          uint8_t opened_payload[4];
          opened_payload[0] = Remote_Open ? 0x05 : 0x02; // remote vs card
          opened_payload[1] = 0x00;
          opened_payload[2] = 0x00;
          opened_payload[3] = Remote_Open ? 0x02 : 0x01; // trigger remote vs local
          publish_mqtt_frame(MSG_TYPE_EVENT, CMD_LOCK_OPENED, opened_payload, 4, topic_event);

          if (Remote_Open) {
            DEBUG_PRINTLN("[MQTT REMOTE] Uzaktan acma komutu basariyla tamamlandi. ACK gonderiliyor.");
            send_mqtt_ack(remote_open_request_id, 0x03, CMD_REMOTE_OPEN, 0x00); // REMOTE COMPLETED
            Remote_Open = false;
          }
        } else {
          DEBUG_PRINTLN("[STM32 -> MQTT] Kilit acilma olayi sunucuya GONDERILEMEDI (MQTT Baglantisi Yok)!");
        }
        break;
      }
      case STM32_CMD_QUERY_SETTINGS: {
        if (len >= 2) {
          DEBUG_PRINTF("Ayarlar: Ses=%d, Dil=%d\n", payload[0], payload[1]);
        }
        break;
      }
      case STM32_CMD_QUERY_TIME: {
        DEBUG_PRINTLN("STM32 zaman senkronizasyonu talep etti.");
        if (mqtt_connected) {
          DEBUG_PRINTLN("[STM32 -> MQTT] Sunucudan zaman senkronizasyon verisi talep ediliyor...");
          publish_mqtt_frame(MSG_TYPE_REQUEST, CMD_TIME_SYNC, NULL, 0, topic_cmd);
        } else {
          DEBUG_PRINTLN("[STM32 -> MQTT] Zaman senkronizasyonu sunucuya GONDERILEMEDI (MQTT Baglantisi Yok)!");
          uint8_t resp_data[2] = {STM32_CMD_QUERY_TIME, STM32_RESP_NO_WIFI};
          sendSTM32Packet(STM32_CMD_RESPONSE, resp_data, 2);
        }
        break;
      }
      case STM32_CMD_EVENT_LOG: {
        if (len >= 7) {
          uint8_t total_count = payload[6];
          int log_count = (len - 7) / 9;
          DEBUG_PRINTF("\nCevrimdisi log sayisi: %d\n", log_count);

          if (log_count > 0) {
            if (mqtt_connected) {
              DEBUG_PRINTF("[STM32 -> MQTT] %d adet cevrimdisi log sunucuya aktariliyor...\n", log_count);
              uint8_t log_payload[256];
              log_payload[0] = (uint8_t)log_count;
              size_t offset = 1;

              for (int i = 0; i < log_count; i++) {
                const uint8_t *log_entry = &payload[7 + (i * 9)];
                uint8_t event_type = log_entry[1];
                uint32_t user_id = (log_entry[2] << 16) | (log_entry[3] << 8) | log_entry[4];
                uint32_t unix_time = (log_entry[5] << 24) | (log_entry[6] << 16) | (log_entry[7] << 8) | log_entry[8];

                uint64_t ts_ms = (uint64_t)unix_time * 1000ULL;
                for (int j = 0; j < 8; j++) {
                  log_payload[offset++] = (ts_ms >> (56 - j * 8)) & 0xFF;
                }

                log_payload[offset++] = 0x02; // accessMethod = NFC
                uint16_t localId = user_id & 0xFFFF;
                log_payload[offset++] = (localId >> 8) & 0xFF;
                log_payload[offset++] = localId & 0xFF;
                log_payload[offset++] = (event_type == 0x01) ? 0x00 : 0x01; // result
              }

              publish_mqtt_frame(MSG_TYPE_EVENT, CMD_OFFLINE_LOG_BATCH, log_payload, offset, topic_log);
            } else {
              DEBUG_PRINTLN("[STM32 -> MQTT] Cevrimdisi loglar sunucuya GONDERILEMEDI (MQTT Baglantisi Yok)!");
              uint8_t err_data[2] = {STM32_CMD_EVENT_LOG, STM32_RESP_NO_WIFI};
              sendSTM32Packet(STM32_CMD_RESPONSE, err_data, 2);
            }
          }
        }
        break;
      }
      case STM32_CMD_FACTORY_RESET: {
        DEBUG_PRINTLN("STM32'den Fabrika Ayarlarına Dönüş Sinyali Alındı");
        if (mqtt_connected) {
          // Sıfırlama olayını sunucuya gönder
          publish_mqtt_frame(MSG_TYPE_EVENT, CMD_FACTORY_RESET, NULL, 0, topic_event);
        }
        delay(1000);
        resetWiFi();
        break;
      }
      case STM32_CMD_WIFI_RESET: {
        DEBUG_PRINTLN("STM32'den Wi-Fi Sıfırlama Sinyali Alındı");
        clearWiFiCredentials();
        delay(500);
        ESP.restart();
        break;
      }
      case 0x12: { // CMD_PIN_ENTERED (Şifre Girildi)
        DEBUG_PRINTLN("STM32'den Şifre Girildi (0x12) komutu alindi.");
        if (mqtt_connected) {
          uint8_t pin_payload[32];
          uint8_t pin_len = (len < 10) ? len : 10;
          pin_payload[0] = pin_len;
          memcpy(pin_payload + 1, payload, pin_len);
          uint32_t reqId = mqtt_seq;
          pin_payload[1 + pin_len] = (reqId >> 24) & 0xFF;
          pin_payload[1 + pin_len + 1] = (reqId >> 16) & 0xFF;
          pin_payload[1 + pin_len + 2] = (reqId >> 8) & 0xFF;
          pin_payload[1 + pin_len + 3] = reqId & 0xFF;

          pending_mcu_cmd = cmd;
          pending_mcu_seq = mqtt_seq;
          pending_mcu_time = millis();

