buraky36/Barfas_Projects/myProjects/1_Access_Control_Terminal/Docs/ESP32_BLE_Wifi_V201/ESP32_BLE_Wifi_V201.ino
          publish_mqtt_frame(MSG_TYPE_EVENT, CMD_PIN_ENTERED, pin_payload, 1 + pin_len + 4, topic_event);
        } else {
          DEBUG_PRINTLN("MQTT baglantisi yok, red yaniti gonderiliyor.");
          uint8_t err_code = 0x02; // STATUS 0x02 = timeout/hata
          sendSTM32Packet(cmd, &err_code, 1);
        }
        break;
      }
      case 0x13: { // CMD_NFC_SCANNED (NFC Kart Okundu)
        DEBUG_PRINTLN("STM32'den NFC Okundu (0x13) komutu alindi.");
        if (mqtt_connected) {
          uint8_t nfc_payload[32];
          
          // Convert ASCII hex representation back to raw bytes
          uint8_t raw_len = 0;
          for (int i = 0; i < len - 1 && raw_len < 16; i += 2) {
            char high_char = (char)payload[i];
            char low_char = (char)payload[i+1];
            
            uint8_t high = (high_char >= '0' && high_char <= '9') ? (high_char - '0') :
                           (high_char >= 'a' && high_char <= 'f') ? (high_char - 'a' + 10) :
                           (high_char >= 'A' && high_char <= 'F') ? (high_char - 'A' + 10) : 0;
            uint8_t low = (low_char >= '0' && low_char <= '9') ? (low_char - '0') :
                          (low_char >= 'a' && low_char <= 'f') ? (low_char - 'a' + 10) :
                          (low_char >= 'A' && low_char <= 'F') ? (low_char - 'A' + 10) : 0;
                          
            nfc_payload[1 + raw_len] = (high << 4) | low;
            raw_len++;
          }
          
          nfc_payload[0] = raw_len;

          pending_mcu_cmd = cmd;
          pending_mcu_seq = mqtt_seq;
          pending_mcu_time = millis();

          publish_mqtt_frame(MSG_TYPE_EVENT, CMD_NFC_SCANNED, nfc_payload, 1 + raw_len, topic_event);
        } else {
          DEBUG_PRINTLN("MQTT baglantisi yok, red yaniti gonderiliyor.");
          uint8_t err_code = 0x02; // STATUS 0x02 = timeout/hata
          sendSTM32Packet(cmd, &err_code, 1);
        }
        break;
      }
      case 0x14: { // CMD_QR_SCANNED (QR Kod Okundu)
        DEBUG_PRINTLN("STM32'den QR Okundu (0x14) komutu alindi.");
        if (mqtt_connected) {
          uint8_t qr_payload[256];
          uint16_t qr_len = (len < 200) ? len : 200;
          qr_payload[0] = (qr_len >> 8) & 0xFF;
          qr_payload[1] = qr_len & 0xFF;
          memcpy(qr_payload + 2, payload, qr_len);

          pending_mcu_cmd = cmd;
          pending_mcu_seq = mqtt_seq;
          pending_mcu_time = millis();

          publish_mqtt_frame(MSG_TYPE_EVENT, CMD_QR_SCANNED, qr_payload, 2 + qr_len, topic_event);
        } else {
          DEBUG_PRINTLN("MQTT baglantisi yok, red yaniti gonderiliyor.");
          uint8_t err_code = 0x02; // STATUS 0x02 = timeout/hata
          sendSTM32Packet(cmd, &err_code, 1);
        }
        break;
      }
      case 0x15: { // CMD_FINGERPRINT_SCANNED (Parmak Izi Okundu)
        DEBUG_PRINTLN("STM32'den Parmak Izi Okundu (0x15) komutu alindi.");
        if (mqtt_connected) {
          uint8_t fp_payload[2] = {0, 0};
          if (len >= 2) {
            fp_payload[0] = payload[0];
            fp_payload[1] = payload[1];
          } else if (len == 1) {
            fp_payload[1] = payload[0];
          }

          pending_mcu_cmd = cmd;
          pending_mcu_seq = mqtt_seq;
          pending_mcu_time = millis();

          publish_mqtt_frame(MSG_TYPE_EVENT, CMD_FINGERPRINT_SCANNED, fp_payload, 2, topic_event);
        } else {
          DEBUG_PRINTLN("MQTT baglantisi yok, red yaniti gonderiliyor.");
          uint8_t err_code = 0x02; // STATUS 0x02 = timeout/hata
          sendSTM32Packet(cmd, &err_code, 1);
        }
        break;
      }
      case 0x16: { // CMD_BUTTON_UNLOCK_REQ (Butonla Kilit Açma İsteği)
        DEBUG_PRINTLN("STM32'den Butonla Kilit Açma (0x16) komutu alindi.");
        if (mqtt_connected) {
          uint8_t btn_payload[5] = {0x01, 0, 0, 0, 0};
          uint32_t reqId = mqtt_seq;
          btn_payload[1] = (reqId >> 24) & 0xFF;
          btn_payload[2] = (reqId >> 16) & 0xFF;
          btn_payload[3] = (reqId >> 8) & 0xFF;
          btn_payload[4] = reqId & 0xFF;

          pending_mcu_cmd = cmd;
          pending_mcu_seq = mqtt_seq;
          pending_mcu_time = millis();

          publish_mqtt_frame(MSG_TYPE_EVENT, CMD_BUTTON_UNLOCK_REQ, btn_payload, 5, topic_event);
        } else {
          DEBUG_PRINTLN("MQTT baglantisi yok, red yaniti gonderiliyor.");
          uint8_t err_code = 0x02; // STATUS 0x02 = timeout/hata
          sendSTM32Packet(cmd, &err_code, 1);
        }
        break;
      }
      case CMD_FP_ENROLLED: { // 0x26 Parmak Izi Kayit Tamamlandi
        DEBUG_PRINTLN("STM32'den Parmak Izi Kayit Tamamlandi (0x26) komutu alindi.");
        if (mqtt_connected) {
          uint8_t fp_payload[6];
          fp_payload[0] = (active_fp_enroll_request_id >> 24) & 0xFF;
          fp_payload[1] = (active_fp_enroll_request_id >> 16) & 0xFF;
          fp_payload[2] = (active_fp_enroll_request_id >> 8) & 0xFF;
          fp_payload[3] = active_fp_enroll_request_id & 0xFF;

          uint16_t localId = 0;
          if (len >= 2) {
            localId = (payload[0] << 8) | payload[1];
          } else if (len == 1) {
            localId = payload[0];
          }
          fp_payload[4] = (localId >> 8) & 0xFF;
          fp_payload[5] = localId & 0xFF;

          publish_mqtt_frame(MSG_TYPE_EVENT, CMD_FP_ENROLLED, fp_payload, 6, topic_event);
        } else {
          DEBUG_PRINTLN("MQTT baglantisi yok, log sunucuya gonderilemedi.");
        }
        break;
      }
      case CMD_CARD_ENROLLED: { // 0x27 NFC Kart Kayit Tamamlandi
        DEBUG_PRINTLN("STM32'den NFC Kart Kayit Tamamlandi (0x27) komutu alindi.");
        if (mqtt_connected) {
          uint8_t card_payload[6];
          card_payload[0] = (active_nfc_enroll_request_id >> 24) & 0xFF;
          card_payload[1] = (active_nfc_enroll_request_id >> 16) & 0xFF;
          card_payload[2] = (active_nfc_enroll_request_id >> 8) & 0xFF;
          card_payload[3] = active_nfc_enroll_request_id & 0xFF;

          uint16_t localId = 0;
          if (len >= 2) {
            localId = (payload[0] << 8) | payload[1];
          } else if (len == 1) {
            localId = payload[0];
          }
          card_payload[4] = (localId >> 8) & 0xFF;
          card_payload[5] = localId & 0xFF;

          publish_mqtt_frame(MSG_TYPE_EVENT, CMD_CARD_ENROLLED, card_payload, 6, topic_event);
        } else {
          DEBUG_PRINTLN("MQTT baglantisi yok, log sunucuya gonderilemedi.");
        }
        break;
      }
      default:
        break;
    }

    size_t packet_size = 5 + payload_len;
    stm32_buffer_len -= packet_size;
    if (stm32_buffer_len > 0)
      memmove(stm32_buffer, stm32_buffer + packet_size, stm32_buffer_len);
  } else {
    stm32_buffer_len--;
    if (stm32_buffer_len > 0)
      memmove(stm32_buffer, stm32_buffer + 1, stm32_buffer_len);
  }
}

