buraky36/Barfas_Projects/myProjects/1_Access_Control_Terminal/Docs/ESP32_BLE_Wifi_V201/ESP32_BLE_Wifi_V201.ino
void sendSTM32Packet(uint8_t cmd, const uint8_t *payload, uint8_t payload_len) {
  uint8_t protocol_len = payload_len + 1;
  uint8_t header = 0xA5;
  uint8_t footer = 0x5A;
  uint16_t checksum = cmd + protocol_len;

  SerialUART.write(header);
  SerialUART.write(cmd);
  SerialUART.write(protocol_len);

  DEBUG_PRINT(">>> [MCU TX RAW] ");
  DEBUG_PRINTF("%02X %02X %02X ", header, cmd, protocol_len);

  for (int i = 0; i < payload_len; i++) {
    SerialUART.write(payload[i]);
    checksum += payload[i];
    DEBUG_PRINTF("%02X ", payload[i]);
  }

  uint8_t cs_byte = checksum & 0xFF;
  SerialUART.write(cs_byte);
  SerialUART.write(footer);
  DEBUG_PRINTF("%02X %02X\n", cs_byte, footer);

  // Gönderilen yanıt detayını anlaşılır şekilde yazdır
  if (cmd == STM32_CMD_RESPONSE && payload_len >= 2) {
    uint8_t orig_cmd = payload[0];
    uint8_t resp_status = payload[1];
    String status_str;
    switch (resp_status) {
      case STM32_RESP_OK: status_str = "OK (Basarili)"; break;
      case STM32_RESP_ERROR: status_str = "HATA (Genel Hata)"; break;
      case STM32_RESP_NO_WIFI: status_str = "HATA (Internet/MQTT Baglantisi Yok)"; break;
      case STM32_RESP_SERVER_ERR: status_str = "HATA (Sunucu Hatasi)"; break;
      case STM32_RESP_SERVER_REJ: status_str = "HATA (Sunucu Reddedildi)"; break;
      default: status_str = "Bilinmeyen Kod: " + String(resp_status); break;
    }
    DEBUG_PRINTF("[MCU TX DETAY] STM32'nin 0x%02X komutuna yanıt verildi. Durum: %s\n", orig_cmd, status_str.c_str());
  }
}

void sendSTM32SoundSetting(uint8_t enable) {
  uint8_t value = enable ? 0x01 : 0x00;
  sendSTM32Packet(STM32_CMD_SET_SOUND, &value, 1);
}

void sendSTM32LanguageSetting(uint8_t english) {
  uint8_t value = english ? 0x01 : 0x00;
  sendSTM32Packet(STM32_CMD_SET_LANGUAGE, &value, 1);
}

void sendSTM32FindDevice() {
  sendSTM32Packet(STM32_CMD_FIND_DEVICE, nullptr, 0);
}

void sendSTM32QuerySettings() {
  sendSTM32Packet(STM32_CMD_QUERY_SETTINGS, nullptr, 0);
}

void sendSTM32QueryBattery() {
  sendSTM32Packet(STM32_CMD_QUERY_BATTERY, nullptr, 0);
}
